// HomeWork_JavaScript_2!
// =========================================================================================


// 1:

var a = '1'; // 'Верно'
a = 1; // 'Неверно'
a = 3; // 'Неверно'

if ( a === '1' ) {
    alert('Верно');
} else {
    alert('Неверно');
}
// =========================================================================================


// 2: 

var item = 1;
item = 0;

// 2.1:

if ( item != true) {
    alert('Верно');
} else {
    alert('Неверно');
}

// 2.2:

( item != true ) ? 
    alert('Верно') : alert('Неверно');
// =========================================================================================


// 3: 

var a = 4; // 'Неверно'
a = 0; // 'Неверно'
a = -3; // 'Неверно'
a = 2; // 'Верно'

if ( a > 0 && a < 4 ) {
    alert('Верно');
} else {
    alert('Неверно');
}
// =========================================================================================


// 4: 

var a = 12;
var b = 14;

if ( a > 3 && a < 12 || b >= 7 && b < 15 ) {
    alert('Верно');
} else {
    alert('Неверно');
}
// =========================================================================================


// 5: 

var month = 1;

if ( month > 0 && month < 3 || month == 12 ) {
    alert("зима");
} else if ( month > 2 && month < 6) {
    alert("весна");
} else if ( month > 5 && month < 9) {
    alert("лето");
} else if ( month > 8 && month < 12) {
    alert("осень");
} else {
    alert("нет такого месяца");
}
// =========================================================================================


// 6:

for(var i = 0; i <= 100; i++){
    if( i%2 == 1 ){
        console.log(i+1);
    }
    
}

// Или так:

for(var i = 0; i <= 100; i++){
    if( i%2 == 0 ){
        continue;
    }
    console.log(i+1);
}
// =========================================================================================